app/controllers/posts_controller.rb

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts"
---
  def index
    # raise params.inspect
    if params[:author_id]
      @posts = Author.find(params[:author_id]).posts
    else
      @posts = Post.all